# IFCHybrid Import Import Elements(Document, String) Method

Source: https://www.revitapidocs.com/2026/7d0a704f-1f57-ffe4-8853-a2326dfaf88d.htm

---

| IFCHybrid Import Import Elements(Document, String) Method |
| --- |

**Note: This API is now obsolete.**

Imports IFC Elements using AnyCAD.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the importElements function with the IFCHybridImportOptions.")]
public IList<ElementId> ImportElements(
	Document doc,
	string file
)
```

```
<ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the importElements function with the IFCHybridImportOptions.")>
Public Function ImportElements (
	doc As Document,
	file As String
) As IList(Of ElementId)
```

```
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Please use the importElements function with the IFCHybridImportOptions.")]
IList<ElementId^>^ ImportElements(
	Document^ doc,
	String^ file
)
```

```
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the importElements function with the IFCHybridImportOptions.")>]
member ImportElements :
        doc : Document *
        file : string -> IList<ElementId>
```

#### Parameters

doc Document
:   Document to receive elements from the IFC file import.

file String
:   Full path of the file to import.

#### Return Value

IList ElementId
Returns an array of ElementIds representing created elements. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCHybridImport Class ImportElements Overload Autodesk.Revit.DB.IFC Namespace